# encoding: utf-8
boardInfo = {513: u'邢卫老师答疑', 514: u'周波老师答疑', 515: u'住房信息', 7: u'王何宇老师答疑', 520: u'心系西部协会', 614: u'莫失莫忘', 15: u'体育运动', 16: u'自由贴图', 17: u'论坛事务', 20: u'冯晓霞老师答疑', 21: u'何善蒙老师答疑', 23: u'肖少拥老师答疑', 25: u'天籁之音', 26: u'读书时光', 540: u'陆维敏老师答疑', 30: u'动漫讨论', 546: u'苏振华老师答疑', 603: u'孟涛老师答疑', 36: u'王云武老师答疑', 605: u'策划部工作室', 550: u'皇城根儿', 551: u'绿色心情', 249: u'编辑部工作室', 41: u'楼学庆老师答疑', 42: u'杨起帆老师答疑', 519: u'机器人协会', 47: u'陈越老师答疑', 49: u'方红光老师答疑', 562: u'数码交易', 563: u'服饰美肤', 52: u'陆汉权老师答疑', 568: u'杨万喜老师答疑', 569: u'代理专区', 58: u'信电ISEE', 60: u'MSTC', 574: u'胡敏老师答疑', 575: u'顾宗华老师答疑版', 576: u'黑白剧社', 578: u'蒋文华老师答疑', 579: u'陈华钧老师答疑', 68: u'学习天地', 581: u'研究生', 583: u'蓝田学园', 584: u'云峰学园', 585: u'丹青学园', 587: u'HPA保健协会', 588: u'吕萍老师答疑', 589: u'黄正谦老师答疑', 590: u'王强老师答疑', 80: u'生活点滴', 81: u'感性空间', 83: u'魏宝刚老师答疑', 596: u'八桂飘香', 599: u'彭笑刚老师答疑', 600: u'楼辉老师答疑', 601: u'沈钦仙老师答疑', 602: u'孙凌云老师答疑', 91: u'游戏广场', 736: u'研创CIE', 606: u'体育部工作室', 607: u'部长联席会议', 610: u'意见与建议', 611: u'通知通告', 100: u'校园信息', 101: u'个性生活', 102: u'彼岸阳光', 615: u'孟炳泉老师答疑', 38: u'站规修订', 105: u'编程技术', 618: u'成长互助训练营GCC', 620: u'赞助合作', 623: u'海洋学院', 624: u'计算机通识答疑', 625: u'黔山秀水', 114: u'郁闷小屋', 115: u'休闲娱乐', 628: u'E志者协会', 629: u'陈实老师答疑', 631: u'管理学课程交流', 632: u'陈纯老师答疑', 633: u'近现代中国的人物研究答疑版', 634: u'董平老师答疑', 635: u'戴俊飞老师答疑版', 640: u'刘海风老师答疑', 129: u'杭高毕业生专版', 642: u'椰风海韵', 135: u'开怀一笑', 136: u'98博物馆', 535: u'面向对象程序设计答疑中心', 140: u'古红英老师答疑', 144: u'一路走来', 145: u'传媒与国际文化学院', 147: u'行者无疆', 149: u'李岩老师答疑', 151: u'孙建伶老师答疑', 152: u'缘分天空', 158: u'E电园', 164: u'影视综艺', 710: u'沈语冰老师答疑', 173: u'光影留痕', 176: u'Fantasy动漫社', 180: u'数码世界', 182: u'心灵之约', 183: u'陆魁军老师答疑', 184: u'论坛帮助', 187: u'科技探索者协会', 190: u'学军中学', 193: u'生仪大家庭', 194: u'梵音剧社', 195: u'法学研究会', 198: u'新生宝典', 713: u'未企俱乐部', 714: u'王跃明老师答疑', 204: u'冯雁老师答疑', 205: u'张引老师的答疑版', 206: u'DFM街舞社', 207: u'郑扣根老师答疑', 208: u'翁恺老师答疑', 723: u'李浩然老师答疑', 724: u'胡吉明老师答疑', 213: u'墨语茗音', 726: u'董玮老师答疑', 727: u'王毅老师答疑', 728: u'陈文智老师答疑', 548: u'姜晓红老师答疑', 733: u'陈奇老师答疑版', 222: u'慈中家园', 224: u'钱抱清老师答疑', 226: u'电脑医院', 229: u'美食健康', 744: u'NexusHD高清社区', 745: u'刘新国老师答疑', 235: u'求职广场', 749: u'社科学术', 751: u'李啸风物理化学答疑', 752: u'雷勇老师答疑', 241: u'医学院', 754: u'我是工程师', 245: u'技术组工作室', 758: u'似水流年', 759: u'曲苑杂坛', 760: u'文学交流', 761: u'高在峰老师课程交流', 254: u'学生旅游协会 ', 247: u'动力机能', 258: u'宠物情缘', 214: u'不败光电', 262: u'天下一家', 263: u'考研一族', 264: u'浙大广电', 216: u'梦想天堂', 404: u'98足迹', 217: u'材化演绎', 559: u'吴江琴老师答疑', 284: u'建工学院', 285: u'碧水青禾', 286: u'坛庆策划', 287: u'SCDA', 292: u'高晴老师答疑', 294: u'竺可桢学院', 50: u'徐镜春老师答疑', 303: u'国防协会', 304: u'外语学习', 307: u'人文学院', 310: u'心理学会', 311: u'杨义群老师答疑', 312: u'怪力乱神', 315: u'98网事', 319: u'光华法学院', 320: u'生命科学学院', 321: u'生工食品学院', 323: u'白洪欢老师答疑', 325: u'贾厚玉老师答疑', 326: u'集思广益', 329: u'编程答疑', 330: u'学生社团联合会', 334: u'红十字会学生分会', 341: u'药学院', 57: u'数学之韵', 344: u'环资经纬', 347: u'学生三农协会', 351: u'天下为公', 352: u'经济学院', 353: u'真我风采', 355: u'辩论队与求是辩论社', 357: u'信息资讯', 361: u'学生无极棋社', 362: u'教育杏坛', 369: u'学生空手道协会 ', 371: u'控制天下', 626: u'杨颖老师答疑', 374: u'理学院', 375: u'张重辉老师答疑', 377: u'动科天地CAS', 507: u'鼎豫中原', 383: u'张彤彧老师答疑', 747: u'Banner申请', 393: u'爱心社', 67: u'管理学院', 40: u'站务讨论', 408: u'陈建海老师答疑', 412: u'精品课程C语言答疑中心', 423: u'方宁老师答疑版', 427: u'季江民老师答疑版块', 613: u'招贤纳士', 431: u'学生校友联络协会', 432: u'陈平老师答疑', 433: u'网络安全', 434: u'亦心·民韵舞社', 436: u'杨式太极拳协会', 437: u'社团百花园', 440: u'丁展平老师答疑', 442: u'谈艺论戏', 221: u'版主会议厅', 446: u'桥牌天地', 448: u'张军老师答疑', 451: u'胡兰青老师答疑', 452: u'胡兰青老师答疑', 246: u'外语学院', 454: u'董亚波老师答疑', 753: u'CC98协会', 457: u'史治国老师答疑', 459: u'实习兼职', 461: u'在浙之滨', 248: u'计算机科学与技术学院', 467: u'三湘四水', 468: u'津门故里', 469: u'航空航天学院', 471: u'齐鲁青未了', 472: u'蓉汇贯川', 475: u'三秦大地', 476: u'秀山丽水（丽水）', 165: u'绿之源协会', 480: u'八闽来风', 481: u'江南西道', 482: u'一皖情深', 483: u'燕赵飞歌', 484: u'吴韵汉风', 485: u'辽地永宁', 486: u'新上海滩', 487: u'诗画杭城（杭州）', 489: u'黑土风情', 491: u'白山松水', 492: u'巴渝人家', 493: u'天山南北', 494: u'方富民老师答疑', 495: u'千岛海韵（舟山）', 497: u'烟雨江南（嘉兴）', 498: u'晋善晋美', 595: u'陈志坚老师答疑', 501: u'朱晔老师答疑', 502: u'塞上风光', 503: u'彩云之南', 504: u'荆楚纵横', 505: u'邦锦梅朵', 506: u'粤来客栈', 255: u'物理系版', 511: u'丝路花雨'}
HTTPS_LIST = ["file.cc98.org", "wx1.sinaimg.cn", "wx2.sinaimg.cn", "wx3.sinaimg.cn", "wx4.sinaimg.cn",]
aboutmd="""
# About cc98.tech

## 功能介绍

### 现在有哪些好玩的功能？

* 手机端适配，即使用手机也能愉快地水98
* 登录后每天自动签到，不再忘记签到
* 查询自己的历史发帖，看看自己在98留下的回忆
* 水楼列表，自动记住上次水的位置，全站打卡领米
* 保存页面功能，而且可以导出压缩包 上十大了来保存一下呗~
* 去年今日的热门话题浏览，可以查到近五年的当日最多回复话题
* 悬浮显示功能：帖子列表鼠标放到标题上，或者点击标题下方一栏即可显示；双击悬浮区域关闭
* 帖子标签功能：给帖子加标签吧
* 快速传图 你只需要复制图片后Ctrl+V就上传好了 无需再另存为选择上传

### 一些特点

* 回帖和发新帖你的输入有自动保存
* 所有数据均缓存，没有烦人的转圈圈，即使98官网崩了仍然可以正常显示大部分数据
* 不显示签名档
* 帖子每一页显示100条回复，不用频繁翻页
* 帖子页面折叠纯引用，不用再相同的回复内容中浪费时间
* 纯内网可以访问，用IE也可以访问看帖

### TODO List

已知的bug 需要赶紧修复：

* 发帖标签选择 目前部分版面会发帖失败

正在开发：

* 屏蔽标签功能设置，不看特定标签、板块的帖子

下面的功能以后会慢慢开发，敬请期待？

* 更好的查询历史回复
* 全站全文搜索（学习一个Elasticsearch）
* 通知功能
* 发新帖用的编辑器 考虑为了便于转帖搞个html转md（需要考虑图片转存）

## FAQ

### 这个域名和cc98.org官方有关系嘛？

没有

### 关于登录

现在已经支持cc98.org官网OAuth登录，如果你使用的是cc98.tech域名访问本站，那就可以安全地使用OAuth登录

类似于你使用微博授权登录其他站点一样，其他站点拿不到你的微博密码

在OAuth登录不可用时，你还是可以使用用户名密码登录，我不会记录你的密码，仅暂时存储在内存中 退出登录即销毁

### 为什么要开发这个网站

主要是自己用着开心舒服，可以随意实现自己的想法进行开发

## 这个网站基于cc98api

[https://github.com/zjuchenyuan/cc98api](https://github.com/zjuchenyuan/cc98api)

你也可以基于这个进行客户端开发（比如恢复98的旧版）


### 最后打个广告

Join us, fight together: [https://www.zjusec.com](https://www.zjusec.com)

My Notebook: [https://py3.io](https://py3.io)
"""
